; domain
;; Schedule World
;;

(define (domain schedule)
  (:requirements :typing :equality :conditional-effects :negative-preconditions)
  (:types temperature-type
	  ashape
	  surface
	  machine
	  part
	  colour
	  width
	  anorient)

  (:constants cold hot - temperature-type
	      cylindrical - ashape 
	      polisher roller lathe grinder punch drill-press
	      spray-painter immersion-painter - machine
              polished rough smooth - surface)

  (:predicates (temperature ?obj - part ?temp - temperature-type)
	       (busy ?machine - machine)
	       (scheduled ?obj - part)
	       (objscheduled)
	       (surface-condition ?obj - part ?surface-cond - surface)
	       (shape ?obj - part ?shape - ashape)
	       (painted ?obj - part ?colour - colour)
	       (has-hole ?obj - part ?width - width ?orientation - anorient)
	       (has-bit ?machine - machine ?width - width)
	       (can-orient ?machine - machine ?orientation - anorient)
	       (has-paint ?machine - machine ?colour - colour))

  (:action do-polish
	   :parameters (?x - part)
	   :precondition (and (not (busy polisher))
			      (not (scheduled ?x))
			      (temperature ?x cold))
	   :effect (and (busy polisher)
			(scheduled ?x)
			(surface-condition ?x polished)
			(when (not (objscheduled))
			  (objscheduled))
			(forall (?oldsurface - surface)
				(when (and (surface-condition ?x ?oldsurface)
                                           (not (= ?oldsurface polished)))
				  (not (surface-condition ?x ?oldsurface))))))

  (:action do-roll
	   :parameters (?x - part)
	   :precondition (and (not (busy roller))
			      (not (scheduled ?x)))
	   :effect (and
		    (busy roller)
		    (scheduled ?x)
		    (temperature ?x hot)
		    (shape ?x cylindrical)
		    (when (not (objscheduled))
		      (objscheduled))
		    (forall (?oldsurface - surface)
			    (when (surface-condition ?x ?oldsurface)
			      (not (surface-condition ?x ?oldsurface))))
		    (forall (?oldpaint - colour)
			    (when (painted ?x ?oldpaint)
			      (not (painted ?x ?oldpaint))))
		    (forall (?oldwidth - width ?oldorient - anorient)
			    (when (has-hole ?x ?oldwidth ?oldorient)
			      (not (has-hole ?x ?oldwidth ?oldorient))))
		    (forall (?oldshape - ashape)
			    (when (and (shape ?x ?oldshape)
                                       (not (= ?oldshape cylindrical)))
			      (not (shape ?x ?oldshape))))
		    (forall (?oldtemp - temperature-type)
			    (when (and (temperature ?x ?oldtemp)
                                       (not (= ?oldtemp hot)))
			      (not (temperature ?x ?oldtemp))))))

  (:action do-lathe
	   :parameters (?x - part) 
	   :precondition (and (not (busy lathe))
			      (not (scheduled ?x)))
	   :effect (and 
		    (busy lathe)
		    (scheduled ?x)
		    (surface-condition ?x rough)
		    (shape ?x cylindrical)
		    (when (not (objscheduled))
		      (objscheduled))
		    (forall (?oldshape - ashape)
			    (when (and (shape ?x ?oldshape)
                                       (not (= ?oldshape cylindrical)))
			      (not (shape ?x ?oldshape))))
		    (forall (?oldsurface - surface)
			    (when (and (surface-condition ?x ?oldsurface)
                                       (not (= ?oldsurface rough)))
			      (not (surface-condition ?x ?oldsurface))))
		    (forall (?oldpaint - colour)
			    (when (painted ?x ?oldpaint)
			    (not (painted ?x ?oldpaint))))))

  (:action do-grind
	   :parameters (?x - part) 
	   :precondition (and (not (busy grinder))
			      (not (scheduled ?x)))
	   :effect (and
		    (busy GRINDER)
		    (scheduled ?x)
		    (surface-condition ?x smooth)
		    (when (not (objscheduled))
		      (objscheduled))
		    (forall (?oldsurface - surface)
			    (when (and (surface-condition ?x ?oldsurface)
                                       (not (= ?oldsurface smooth)))
			      (not (surface-condition ?x ?oldsurface))))
		    (forall (?oldpaint - colour)
			    (when (painted ?x ?oldpaint)
			      (not (painted ?x ?oldpaint))))))

  (:action do-punch
	   :parameters (?x - part ?width - width  ?orient - anorient)  
	   :precondition (and
			  (has-bit punch ?width)
			  (can-orient punch ?orient)
			  (temperature ?x cold)
			  (not (busy punch))
			  (not (scheduled ?x))
			  (not (has-hole ?x ?width ?orient)))
	   :effect (and
		    (busy punch)
		    (scheduled ?x)
		    (has-hole ?x ?width ?orient)
		    (surface-condition ?x rough)
		    (when (not (objscheduled))
		      (objscheduled))
		    (forall (?oldsurface - surface) 
			    (when (and (surface-condition ?x ?oldsurface)
                                       (not (= ?oldsurface rough)))
			      (not (surface-condition ?x ?oldsurface))))))

  (:action do-drill-press
	   :parameters (?x - part ?width - width ?orient - anorient)
	   :precondition (and
			  (has-bit drill-press ?width)
			  (can-orient drill-press ?orient)
			  (temperature ?x cold)
			  (not (busy drill-press))
			  (not (scheduled ?x))
			  (not (has-hole ?x ?width ?orient)))
	   :effect (and
		    (busy drill-press)
		    (scheduled ?x)
		    (has-hole ?x ?width ?orient)
		    (when (not (objscheduled))
		      (objscheduled))))

  (:action do-spray-paint
	   :parameters (?x - part ?newpaint - colour) 
	   :precondition (and
			  (has-paint spray-painter ?newpaint)
			  (not (busy spray-painter))
			  (not (scheduled ?x))
			  (temperature ?x COLD))
	   :effect (and
		    (busy spray-painter)
		    (scheduled ?x)
		    (painted ?x ?newpaint)
		    (when (not (objscheduled))
		      (objscheduled))
		    (forall (?oldsurface - surface)
			    (when (surface-condition ?x ?oldsurface)
			      (not (surface-condition ?x ?oldsurface))))
		    (forall (?oldpaint - colour)
			    (when (and (painted ?x ?oldpaint)
                                       (not (= ?oldpaint ?newpaint)))
			      (not (painted ?x ?oldpaint))))))
  
  (:action do-immersion-paint     
           :parameters (?x - part ?newpaint - colour) 
           :precondition (and
                          (has-paint immersion-painter ?newpaint)
                          (not (busy immersion-painter))
                          (not (scheduled ?x)))
           :effect (and
                    (busy immersion-painter)
                    (scheduled ?x)
                    (painted ?x ?newpaint)
                    (when (not (objscheduled))
                      (objscheduled))
                    (forall (?oldpaint - colour)
                            (when (and (painted ?x ?oldpaint)
                                       (not (= ?oldpaint ?newpaint)))
                              (not (painted ?x ?oldpaint))))))
  
  (:action do-time-step
           :parameters ()
           :precondition (objscheduled)
           :effect (and
                    (forall (?x - part)
                            (when (scheduled ?x)
                              (not (scheduled ?x))))
                    (forall (?m - machine)
                            (when (busy ?m)
                              (not (busy ?m)))))))

; problem
(define (problem schedule-10-0)
(:domain schedule)
(:objects
    J0
    I0
    H0
    G0
    F0
    E0
    D0
    C0
    B0
    A0
 - part
    CIRCULAR
    OBLONG
 - ashape
    BLUE
    YELLOW
    RED
    BLACK
 - colour
    TWO
    THREE
    ONE
 - width
    BACK
    FRONT
 - anorient
)
(:init
    (SHAPE A0 CYLINDRICAL)
    (SURFACE-CONDITION A0 SMOOTH)
    (PAINTED A0 YELLOW)
    (HAS-HOLE A0 THREE BACK)
    (TEMPERATURE A0 COLD)
    (SHAPE B0 CIRCULAR)
    (SURFACE-CONDITION B0 ROUGH)
    (PAINTED B0 BLUE)
    (HAS-HOLE B0 ONE BACK)
    (TEMPERATURE B0 COLD)
    (SHAPE C0 OBLONG)
    (SURFACE-CONDITION C0 POLISHED)
    (PAINTED C0 BLUE)
    (HAS-HOLE C0 THREE FRONT)
    (TEMPERATURE C0 COLD)
    (SHAPE D0 OBLONG)
    (SURFACE-CONDITION D0 ROUGH)
    (PAINTED D0 BLUE)
    (HAS-HOLE D0 TWO BACK)
    (TEMPERATURE D0 COLD)
    (SHAPE E0 OBLONG)
    (SURFACE-CONDITION E0 SMOOTH)
    (PAINTED E0 RED)
    (HAS-HOLE E0 ONE FRONT)
    (TEMPERATURE E0 COLD)
    (SHAPE F0 CIRCULAR)
    (SURFACE-CONDITION F0 SMOOTH)
    (PAINTED F0 BLACK)
    (HAS-HOLE F0 TWO BACK)
    (TEMPERATURE F0 COLD)
    (SHAPE G0 CIRCULAR)
    (SURFACE-CONDITION G0 ROUGH)
    (PAINTED G0 RED)
    (HAS-HOLE G0 ONE BACK)
    (TEMPERATURE G0 COLD)
    (SHAPE H0 OBLONG)
    (SURFACE-CONDITION H0 POLISHED)
    (PAINTED H0 BLACK)
    (HAS-HOLE H0 ONE FRONT)
    (TEMPERATURE H0 COLD)
    (SHAPE I0 CIRCULAR)
    (SURFACE-CONDITION I0 ROUGH)
    (PAINTED I0 YELLOW)
    (HAS-HOLE I0 TWO BACK)
    (TEMPERATURE I0 COLD)
    (SHAPE J0 CYLINDRICAL)
    (SURFACE-CONDITION J0 POLISHED)
    (PAINTED J0 BLACK)
    (HAS-HOLE J0 ONE FRONT)
    (TEMPERATURE J0 COLD)
    (CAN-ORIENT DRILL-PRESS BACK)
    (CAN-ORIENT PUNCH BACK)
    (CAN-ORIENT DRILL-PRESS FRONT)
    (CAN-ORIENT PUNCH FRONT)
    (HAS-PAINT IMMERSION-PAINTER YELLOW)
    (HAS-PAINT SPRAY-PAINTER YELLOW)
    (HAS-PAINT IMMERSION-PAINTER BLUE)
    (HAS-PAINT SPRAY-PAINTER BLUE)
    (HAS-PAINT IMMERSION-PAINTER BLACK)
    (HAS-PAINT SPRAY-PAINTER BLACK)
    (HAS-PAINT IMMERSION-PAINTER RED)
    (HAS-PAINT SPRAY-PAINTER RED)
    (HAS-BIT DRILL-PRESS THREE)
    (HAS-BIT PUNCH THREE)
    (HAS-BIT DRILL-PRESS TWO)
    (HAS-BIT PUNCH TWO)
    (HAS-BIT DRILL-PRESS ONE)
    (HAS-BIT PUNCH ONE)
)
(:goal (and
    (SURFACE-CONDITION H0 SMOOTH)
    (SHAPE E0 CYLINDRICAL)
    (SHAPE D0 CYLINDRICAL)
    (PAINTED I0 BLUE)
    (SHAPE G0 CYLINDRICAL)
    (SHAPE I0 CYLINDRICAL)
    (SURFACE-CONDITION I0 POLISHED)
    (SHAPE C0 CYLINDRICAL)
    (PAINTED C0 BLACK)
    (PAINTED H0 BLUE)
)))

; plan
1. (do-roll d0)
   deleted: (surface-condition d0 rough) (painted d0 blue) (has-hole d0 two back) (shape d0 oblong) (temperature d0 cold)
   added: (busy roller) (scheduled d0) (temperature d0 hot) (shape d0 cylindrical) (objscheduled)
   goals met: 1 of 10
2. (do-grind h0)
   deleted: (surface-condition h0 polished) (painted h0 black)
   added: (busy grinder) (scheduled h0) (surface-condition h0 smooth)
   goals met: 2 of 10
3. (do-lathe i0)
   deleted: (shape i0 circular) (painted i0 yellow)
   added: (busy lathe) (scheduled i0) (shape i0 cylindrical)
   goals met: 3 of 10
4. (do-time-step)
   deleted: (scheduled i0) (scheduled h0) (scheduled d0) (busy roller) (busy lathe) (busy grinder)
   goals met: 3 of 10
5. (do-lathe e0)
   deleted: (shape e0 oblong) (surface-condition e0 smooth) (painted e0 red)
   added: (busy lathe) (scheduled e0) (surface-condition e0 rough) (shape e0 cylindrical)
   goals met: 4 of 10
6. (do-immersion-paint h0 blue)
   added: (busy immersion-painter) (scheduled h0) (painted h0 blue)
   goals met: 5 of 10
7. (do-spray-paint i0 blue)
   deleted: (surface-condition i0 rough)
   added: (busy spray-painter) (scheduled i0) (painted i0 blue)
   goals met: 6 of 10
8. (do-roll c0)
   deleted: (surface-condition c0 polished) (painted c0 blue) (has-hole c0 three front) (shape c0 oblong) (temperature c0 cold)
   added: (busy roller) (scheduled c0) (temperature c0 hot) (shape c0 cylindrical)
   goals met: 7 of 10
9. (do-time-step)
   deleted: (scheduled i0) (scheduled h0) (scheduled e0) (scheduled c0) (busy roller) (busy lathe) (busy spray-painter) (busy immersion-painter)
   goals met: 7 of 10
10. (do-polish i0)
   added: (busy polisher) (scheduled i0) (surface-condition i0 polished)
   goals met: 8 of 10
11. (do-lathe g0)
   deleted: (shape g0 circular) (painted g0 red)
   added: (busy lathe) (scheduled g0) (shape g0 cylindrical)
   goals met: 9 of 10
12. (do-immersion-paint c0 black)
   added: (busy immersion-painter) (scheduled c0) (painted c0 black)
   goals met: 10 of 10
